# Importando dados

In [8]:
import sqlite3
import pandas as pd

1. Abrindo conex√£o com o banco de dados

In [9]:
conn = sqlite3.connect("/home/cristina/Public/projetos/flight_fidelity/db/database.db")

2. Consulta dos dadosL

In [31]:
# Selecionar estas colunas da tabela flight_loyalty_history
read_table = """ 
    SELECT 
        loyalty_number,
        loyalty_card, 
        country,
        city,
        gender,
        salary
    FROM 
        flight_loyalty_history
"""
df = pd.read_sql_query(read_table, conn)
df.head()

   loyalty_number loyalty_card country       city  gender    salary
0          480934         Star  Canada    Toronto  Female   83236.0
1          549612         Star  Canada   Edmonton    Male       NaN
2          429460         Star  Canada  Vancouver    Male       NaN
3          608370         Star  Canada    Toronto    Male       NaN
4          530508         Star  Canada       Hull    Male  103495.0

In [35]:
# Selecionar as mesmas colunas da tabela flight_loyalty_history com as linhas da coluna gender igual a female

query_ = """
    SELECT 
        loyalty_number,
        gender,
        country,
        city,
        salary,
        loyalty_card
    FROM flight_loyalty_history
    WHERE
        gender = 'Female'
"""

df = pd.read_sql_query(query_, conn)
df.head(10)

   loyalty_number  gender country          city    salary loyalty_card
0          480934  Female  Canada       Toronto   83236.0         Star
1          927943  Female  Canada       Toronto       NaN         Star
2          852392  Female  Canada      Montreal  100159.0         Star
3          932823  Female  Canada     Vancouver   66444.0         Star
4          144514  Female  Canada  Dawson Creek   49618.0         Star
5          286114  Female  Canada       Toronto       NaN         Star
6          735304  Female  Canada      Edmonton  128118.0         Star
7          172755  Female  Canada      Edmonton       NaN       Aurora
8          354730  Female  Canada   Fredericton       NaN         Star
9          413741  Female  Canada       Toronto       NaN         Star

In [37]:
query_booked = """
    SELECT
        loyalty_number,
        month, 
        year, 
        distance,
        flights_booked,
        total_flights
    FROM flight_activity
    WHERE flights_booked > 10 AND flights_booked < 12
"""
res = pd.read_sql_query(query_booked, conn)
res.sample(10)

       loyalty_number  month  year  distance  flights_booked  total_flights
5221           455941     10  2017      2844              11             18
1307           296626      3  2017      2937              11             11
14478          855506     11  2018      3298              11             17
10705          236767      6  2018      1953              11             21
5184           415916     10  2017       858              11             11
13488          821739     10  2018      2159              11             17
1061           258849     12  2017      3996              11             18
13650          986288     10  2018      1887              11             17
7260           832625     12  2017      1914              11             11
5460           714121     10  2017       770              11             11

In [38]:
conn.close()